{
  "status": "warning",
  "user_id": "maharaj",
  "theme": "diwali party",
  "content_type": "Promotional",
  "template_used": "listicle",
  "template_name": "Numbered List",
  "subtopics": [
    {
      "header": "Diwali Party: A Blast from the Past",
      "body": "Recreate the magic of your childhood Diwali celebrations with a themed party that'll transport you back to a time of love, laughter, and sparklers!",
      "structure_type": "hook"
    }
  ],
  "slide_contents": {
    "slide_1": {
      "title": "Diwali Party: A Blast from the Past",
      "body": [
        "Recreate the magic of your childhood Diwali celebrations with a themed party that'll transport you back to a time of love, laughter, and sparklers!"
      ],
      "structure_type": "hook",
      "visual_hint": "numbered_list, icons_per_item, scannable_layout"
    }
  },
  "captions": {
    "post_caption": "\"Get ready to transport yourself to a magical night of lights and laughter, as we bring back the essence of Diwali in a way you've never experienced before! 🎉🕯️\n\n**Item 1: The Diwali Party: A Blast from the Past**\nWe're taking a trip down memory lane, revisiting the nostalgic charm of Diwali celebrations from the past. Expect a night of retro music, vintage decor, and old-school games that will transport you back to a bygone era. 🕰️\n\n**Item 2: Delicious Traditional Treats**\nIndulge in a delectable spread of traditional Diwali sweets and snacks, carefully crafted to transport your taste buds to a world of flavors and aromas. From classic gulab jamun to crispy samosas, our culinary delights will leave you craving for more. 🍰\n\n**Item 3: Vibrant Rangoli Designs**\nExperience the beauty of traditional Indian art as we create stunning rangoli designs that will mesmerize your senses. From intricate patterns to vibrant colors, our artisans will bring the magic of Indian culture to life. 🎨\n\n**Item 4: Exciting Games and Contests**\nGet ready to put your skills to the test with our exciting games and contests, designed to bring out the inner child in you. From traditional Indian games to modern twists, we've got something for everyone to enjoy. 🎊\n\n**Item 5: Live Music and Dance Performances**\nImmerse yourself in the rhythms and melodies of India as our talented musicians and dancers take the stage. From classical to contemporary, our performances will keep you enthralled and entertained throughout the night. 🎶\n\n**Bonus: Meet Our Special Guests**\nWe're thrilled to announce that some of India's most talented artists and influencers will be joining us at the Diwali Party, making it an unforgettable night to remember. 🤩\n\nSo, are you ready to experience the magic of Diwali like never before? Join us for an unforgettable night of fun, food, and festivities! What do you think? Comment below! 💬 #CraftingBrain #Promotional #Diwaliparty #Business #Innovation\""
  },
  "summary": [
    "1. Diwali Party: A Blast from the Past: Diwali Party: A Blast from the Past"
  ],
  "business_context": {
    "business_type": "general"
  },
  "meme_mode": false,
  "generation_metadata": {
    "timestamp": "2026-01-07T12:22:02.882900",
    "platforms": [
      "facebook"
    ],
    "business_type": "general",
    "has_logo": false,
    "has_colors": false,
    "groq_used": true,
    "user_id": "maharaj",
    "template_structure": [
      "hook",
      "item1",
      "item2",
      "item3",
      "item4",
      "item5",
      "bonus",
      "cta"
    ],
    "content_type": "Promotional",
    "validation_passed": false
  }
}